In [2]:
%load_ext sql

In [3]:
%%sql postgresql:///jovyan
    SELECT * FROM pg_database

4 rows affected.

[(13761, 'postgres', 10, 6, 'C.UTF-8', 'C.UTF-8', False, True, -1, 13760, '726', '1', 1663, None),
 (16385, 'jovyan', 10, 6, 'C.UTF-8', 'C.UTF-8', False, True, -1, 13760, '726', '1', 1663, None),
 (1, 'template1', 10, 6, 'C.UTF-8', 'C.UTF-8', True, True, -1, 13760, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (13760, 'template0', 10, 6, 'C.UTF-8', 'C.UTF-8', True, False, -1, 13760, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}')]

# Create the tables

In [4]:
%%sql postgresql:///jovyan

CREATE TABLE Employees (
    EMPLOYEE_ID INT PRIMARY KEY,
    FIRST_NAME VARCHAR(30),
    LAST_NAME VARCHAR(30),
    HIRE_DATE DATE,
    JOB_ID VARCHAR(20),
    MANAGER_ID INT,
    DEPARTMENT_ID SMALLINT
);

INSERT INTO Employees (EMPLOYEE_ID, FIRST_NAME, LAST_NAME, HIRE_DATE, JOB_ID, MANAGER_ID, DEPARTMENT_ID) VALUES
(100, 'Steven', 'King', '1987-06-17', 'AD_PRES', 0, 90),
(101, 'Neena', 'Kochhar', '1987-06-18', 'AD_VP', 100, 90),
(102, 'Lex', 'DeHaan', '1987-06-19', 'AD_VP', 100, 90),
(103, 'Alexander', 'Hunold', '1987-06-20', 'IT_PROG', 102, 60),
(107, 'Diana', 'Lorentz', '1987-06-24', 'IT_PROG', 103, 60),
(108, 'Nancy', 'Greenberg', '1987-06-25', 'FI_MGR', 101, 100),
(109, 'Daniel', 'Faviet', '1987-06-26', 'FI_ACCOUNT', 108, 100),
(114, 'Den', 'Raphaely', '1987-07-01', 'PU_MAN', 100, 30),
(118, 'Guy', 'Himuro', '1987-07-05', 'PU_CLERK', 114, 30),
(144, 'Peter', 'Vargas', '1987-07-31', 'ST_CLERK', 114, 50),
(145, 'John', 'Russell', '1987-08-01', 'SA_MAN', 100, 80),
(146, 'Karen', 'Partners', '1987-08-02', 'SA_MAN', 100, 80);

Done.
12 rows affected.

[]

In [5]:
%%sql postgresql:///jovyan

CREATE TABLE Departments (
    DEPARTMENT_ID SMALLINT PRIMARY KEY,
    DEPARTMENT_NAME VARCHAR(50),
    MANAGER_ID INT
);

INSERT INTO Departments (DEPARTMENT_ID, DEPARTMENT_NAME, MANAGER_ID) VALUES
(10, 'Administration', 200),
(30, 'Purchasing', 114),
(40, 'HumanResources', 203),
(50, 'Shipping', 121),
(60, 'IT', 103),
(70, 'PublicRelations', 204),
(80, 'Sales', 145),
(90, 'Executive', 100),
(100, 'Finance', 108),
(110, 'Accounting', 205);

Done.
10 rows affected.

[]

# Write a query which returns a grid: Department name, Manager Name and Number of employees working in each department. Order the output by Department name

In [16]:
%%sql postgresql:///jovyan

SELECT 
    d.department_name, 
    m.first_name AS manager_name, m.last_name AS manager_surname,
    COUNT(e.employee_id) AS employee_number
FROM 
    Departments d
JOIN 
    Employees e ON d.department_id = e.department_id
JOIN 
    Employees m ON d.manager_id = m.employee_id
GROUP BY 
    d.department_name, m.first_name, m.last_name
ORDER BY 
d.department_name

5 rows affected.

[('Executive', 'Steven', 'King', 3),
 ('Finance', 'Nancy', 'Greenberg', 2),
 ('IT', 'Alexander', 'Hunold', 2),
 ('Purchasing', 'Den', 'Raphaely', 2),
 ('Sales', 'John', 'Russell', 2)]

# Conclusion
- Without aliases the query would be too cumbersome to read and understand
- I didn't do the tasks quick enough because I forgot bash syntax, really glad I have my homework tables prepared